Revit 2027 API
BuiltInFailures.SketchFailures.LinesOverlapPath3d Property
 Cannot have overlapping lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinesOverlapPath3d { get; }
Public Shared ReadOnly Property LinesOverlapPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinesOverlapPath3d {
	FailureDefinitionId^ get ();
}
static member LinesOverlapPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace